Revit 2016 API
Rectangle.Top Property
 The y-coordinate of the top-left corner of the rectangle.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public int Top { get; set; }
Visual Basic
Public Property Top As Integer
	Get
	Set
Visual C++
public:
property int Top {
	int get ();
	void set (int value);
}
See Also
Rectangle Class
Autodesk.Revit.UI Namespace